n = int(input())
# rgb [[0,0,0]]
dp = [[0] * 3 for _ in range(n)]


color = []
for _ in range(n):
    # [[26, 40, 83], [49, 60, 57], [13, 89, 99]]
    color.append(list(map(int, input().split())))

# 첫째줄에 color값을 넣어준다.
dp[0] = color[0]


# 예제 1
# (2번째 줄 1. min([0][1]+ [1][0], [0][2] + [1][0])), 2.(min([0][0]+ [1][1], [0][2] + [1][1]) 3.2.(min([0][0]+ [1][2], [0][1] + [1][2])
# min(40 +49, 49+83)), min(60 + 26, 60 + 83), min(57 + 26, 57 + 40)
# (3번째 줄 1. min([1][1]+ [2][0], [1][2] + [1][0])), 2.(min([1][0]+ [2][1], [1][2] + [2][1]) 3.2.(min([1][0]+ [2][2], [1][1] + [2][2])
# min(83 + 13, 86 + 13), min(83 + 89, 89 + 89 ), min(99 + 86 = 185, 99 + 89)
for i in range(1, n):
    dp[i][0] = min(dp[i - 1][1] + color[i][0], dp[i - 1][2] + color[i][0])
    dp[i][1] = min(dp[i - 1][0] + color[i][1], dp[i - 1][2] + color[i][1])
    dp[i][2] = min(dp[i - 1][0] + color[i][2], dp[i - 1][1] + color[i][2])

print(min(dp[n - 1]))
